In [1]:
import pandas as pd # To load files and perform tasks
import numpy as np # linear algebra
import seaborn as sns  # data visualizations
import matplotlib.pyplot as plt # data visualizations

In [3]:
df = pd.read_csv('Final.csv', encoding='cp1252')

In [4]:
df.head()

   Rating           Company  Average    Lowest    Highest yr/mo/hr
0     3.6     Tech Mahindra   937156  4,18,054  23,35,432      /yr
1     3.7             Optum  1508702  8,87,265  24,00,000      /yr
2     4.1           Fresher   540557  1,89,354  14,72,751      /yr
3     3.7  HCL Technologies   887986  4,16,339  19,26,785      /yr
4     3.9           Genpact   972181  2,49,195  23,82,853      /yr

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4100 entries, 0 to 4099
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Rating    3854 non-null   float64
 1   Company   4100 non-null   object
 2   Average   4100 non-null   object
 3   Lowest    4100 non-null   object
 4   Highest   4100 non-null   object
 5   yr/mo/hr  4100 non-null   object
dtypes: float64(1), object(5)
memory usage: 192.3+ KB